# Multi Index Series

- ### Multi-indexed Series in pandas is when you need to represent and manipulate data with multiple levels of indexing. 
<br>

- ### MultiIndex Series is the 2-D Object
<br>

- ### Multi-indexing allows you to organize and access data in a hierarchical structure, which can be useful when dealing with complex datasets.

In [1]:
import pandas as pd
import numpy as np

- ### pd.MultiIndex.from_tuples()
    - ### .levels
    - ### .levshape
    - ### .get_level_values()
- ### pd.MultiIndex.from_product()
<br>

- ### Multiindex Series
- ### Access Multiindex Series
- ### unstack() function on multi index series
- ### stack() function on DataFrame
- ### .reset_index() on Multi index Series
<br>

- ### Multiindex DataFrame
- ### loc and iloc in MultiIndex DataFrame
- ### MultiIndex on Columns
- ### MultiIndex on Both Rows and Columns
- ### Reduced 4-D DataFrame
<br>

- ### Unstacking and Stacking on DataFrame
- ### change levels with levels parameter

## Series is the 1-D Object

In [2]:
sr = pd.Series(["A","B","C"],index=["k1","k2","k3"])
sr

k1    A
k2    B
k3    C
dtype: object

In [3]:
sr.keys()

Index(['k1', 'k2', 'k3'], dtype='object')

In [4]:
sr.values

array(['A', 'B', 'C'], dtype=object)

### Now Access A we need the pass the info only 'k1' (keys)

In [5]:
sr["k1"]

'A'

## DataFrame is the 2-D Object

In [6]:
df = pd.DataFrame(["A","B","C"],index=["k1","k2","k3"],columns=["col"])
df

   col
k1   A
k2   B
k3   C

### Now Access A we need the pass the info ["col"]["k1"] 
<br>

### (keys)(index)

In [7]:
df.keys()

Index(['col'], dtype='object')

In [8]:
df.values

array([['A'],
       ['B'],
       ['C']], dtype=object)

In [9]:
df.index

Index(['k1', 'k2', 'k3'], dtype='object')

In [10]:
df["col"] # now this are series

k1    A
k2    B
k3    C
Name: col, dtype: object

In [11]:
df["col"]["k1"]

'A'

# So in Series have only 1 Index

In [12]:
sr

k1    A
k2    B
k3    C
dtype: object

In [13]:
sr.index # A value - k1 index

Index(['k1', 'k2', 'k3'], dtype='object')

## Can we create a 2 index of 1 Value ?

In [14]:
values = ["A","B","C"]
indexs = [("k1"),("k2"),("k3")]

In [15]:
pd.Series(values,indexs)

k1    A
k2    B
k3    C
dtype: object

In [16]:
sr.keys()

Index(['k1', 'k2', 'k3'], dtype='object')

In [17]:
sr.values

array(['A', 'B', 'C'], dtype=object)

In [18]:
sr.index

Index(['k1', 'k2', 'k3'], dtype='object')

In [19]:
# PASS Multi Index
indexs = [("k1",1),("k2",2),("k3",3)]
sr_ = pd.Series(values,indexs)

In [20]:
sr_

(k1, 1)    A
(k2, 2)    B
(k3, 3)    C
dtype: object

In [21]:
sr_.keys()

Index([('k1', 1), ('k2', 2), ('k3', 3)], dtype='object')

In [22]:
sr_.values

array(['A', 'B', 'C'], dtype=object)

In [23]:
sr_.index

Index([('k1', 1), ('k2', 2), ('k3', 3)], dtype='object')

## Now Try Access A

In [24]:
sr_

(k1, 1)    A
(k2, 2)    B
(k3, 3)    C
dtype: object

In [25]:
# We need both keys
sr_[("k1",1)]

'A'

# So Technically It is not a Multi Indexing

## Use pd.MultiIndex.from_tuples

In [26]:
indexs = [("k1","1"),("k2","2"),("k3","3")]

In [27]:
# pass only index
ms = pd.MultiIndex.from_tuples(indexs)
ms

MultiIndex([('k1', '1'),
            ('k2', '2'),
            ('k3', '3')],
           )

In [28]:
ms[0]

('k1', '1')

In [29]:
ms[1]

('k2', '2')

In [30]:
ms[2]

('k3', '3')

In [31]:
ms.levels

FrozenList([['k1', 'k2', 'k3'], ['1', '2', '3']])

In [32]:
ms.levels[0]

Index(['k1', 'k2', 'k3'], dtype='object')

In [132]:
ms.levels[1]

Index(['1', '2', '3'], dtype='object')

In [131]:
# get level values

ms.get_level_values(0)

Index(['k1', 'k2', 'k3'], dtype='object')

In [34]:
ms.levshape

(3, 3)

In [35]:
tags = ['v1','v2']
k = ["k1","k2","k3"]

In [36]:
# use .from_product 
# pass 2D list
prod = pd.MultiIndex.from_product([tags,k])
prod # hierarchy functionality

MultiIndex([('v1', 'k1'),
            ('v1', 'k2'),
            ('v1', 'k3'),
            ('v2', 'k1'),
            ('v2', 'k2'),
            ('v2', 'k3')],
           )

# Create a MultiIndex Series

In [37]:
multi_index = pd.MultiIndex.from_product([["A","B"],["k1","k2","k3"]])

In [38]:
multi_index

MultiIndex([('A', 'k1'),
            ('A', 'k2'),
            ('A', 'k3'),
            ('B', 'k1'),
            ('B', 'k2'),
            ('B', 'k3')],
           )

In [39]:
values = [1,2,3,4,5,6]
# create a series
multi_series = pd.Series(values,index=multi_index)
multi_series

A  k1    1
   k2    2
   k3    3
B  k1    4
   k2    5
   k3    6
dtype: int64

In [40]:
# Acess 2

multi_series.keys()[1]

('A', 'k2')

In [41]:
multi_series[("A","k2")]

2

In [42]:
# Acess A keys data

multi_series["A"]

k1    1
k2    2
k3    3
dtype: int64

In [43]:
multi_series["A"]["k2"]

2

In [44]:
multi_series

A  k1    1
   k2    2
   k3    3
B  k1    4
   k2    5
   k3    6
dtype: int64

### Convert Multiindex Series to DataFrame with untack()

In [45]:
df = multi_series.unstack()
df

   k1  k2  k3
A   1   2   3
B   4   5   6

In [46]:
df.keys()

Index(['k1', 'k2', 'k3'], dtype='object')

In [47]:
df.values

array([[1, 2, 3],
       [4, 5, 6]])

### Use stack() for convert DataFrame to Multi index Series

In [48]:
df.stack()

A  k1    1
   k2    2
   k3    3
B  k1    4
   k2    5
   k3    6
dtype: int64

### .reset_also used convert multi index series to dataframe

In [49]:
multi_series

A  k1    1
   k2    2
   k3    3
B  k1    4
   k2    5
   k3    6
dtype: int64

In [50]:
multi_series.reset_index()

  level_0 level_1  0
0       A      k1  1
1       A      k2  2
2       A      k3  3
3       B      k1  4
4       B      k2  5
5       B      k3  6

# Multi Index DataFrame

- ### A multi-index DataFrame in pandas is similar to a multi-index Series but extends the concept to a two-dimensional data structure.
<br> 

- ### It is the 3-D Object

<br>

- ### It allows you to represent and manipulate data with multiple levels of indexing along both rows and columns.

In [51]:
multi_index = pd.MultiIndex.from_product([["A","B"],["k1","k2","k3"]])
multi_index

MultiIndex([('A', 'k1'),
            ('A', 'k2'),
            ('A', 'k3'),
            ('B', 'k1'),
            ('B', 'k2'),
            ('B', 'k3')],
           )

In [52]:
df = pd.DataFrame(
    [
        [1,7],
        [2,8],
        [3,9],
        [4,10],
        [5,11],
        [6,12]
    ],
    index= pd.MultiIndex.from_product([["A","B"],["K1","K2","K3"]]),
    columns=["C1","C2"]
)
df

      C1  C2
A K1   1   7
  K2   2   8
  K3   3   9
B K1   4  10
  K2   5  11
  K3   6  12

### Access 2

In [53]:
df.keys()

Index(['C1', 'C2'], dtype='object')

In [54]:
df.index

MultiIndex([('A', 'K1'),
            ('A', 'K2'),
            ('A', 'K3'),
            ('B', 'K1'),
            ('B', 'K2'),
            ('B', 'K3')],
           )

In [55]:
df.values

array([[ 1,  7],
       [ 2,  8],
       [ 3,  9],
       [ 4, 10],
       [ 5, 11],
       [ 6, 12]])

### loc

In [56]:
df.loc[("A")]

    C1  C2
K1   1   7
K2   2   8
K3   3   9

In [57]:
df.loc[("A","K2")]

C1    2
C2    8
Name: (A, K2), dtype: int64

In [58]:
df.loc[("A","K2")]["C1"]

2

In [59]:
df.loc[("A","C1")]["K2"]

2

In [60]:
df

      C1  C2
A K1   1   7
  K2   2   8
  K3   3   9
B K1   4  10
  K2   5  11
  K3   6  12

In [61]:
## Extract A keys
df.loc["A"]

    C1  C2
K1   1   7
K2   2   8
K3   3   9

In [62]:
df

      C1  C2
A K1   1   7
  K2   2   8
  K3   3   9
B K1   4  10
  K2   5  11
  K3   6  12

### iloc

In [63]:
df.iloc[0]

C1    1
C2    7
Name: (A, K1), dtype: int64

In [64]:
df.iloc[1]

C1    2
C2    8
Name: (A, K2), dtype: int64

In [65]:
df.iloc[0,1]

7

In [66]:
df.iloc[1,0]

2

In [67]:
df_1 = pd.DataFrame([
    ["1","Mubeen"],
    ["2","Ali"],
    ["3","Usman"],
    ["4","Bilal"],
    ["5","Naveed"],
    ["6","Rizwan"],
],
    index=pd.MultiIndex.from_product([["Section1","Section2"],["k1","k2","k3"]]),
    columns=["C1","C2"]

)
df_1

            C1      C2
Section1 k1  1  Mubeen
         k2  2     Ali
         k3  3   Usman
Section2 k1  4   Bilal
         k2  5  Naveed
         k3  6  Rizwan

### Now Revert column and index

In [68]:
df_2 = pd.DataFrame([
    ["1","Mubeen","Temp","Temp"],
    ["2","Ali","Temp","Temp"],
    ["3","Usman","Temp","Temp"],
    ["4","Bilal","Temp","Temp"]
],
    index=["C1","C2","C3","C4"],
    columns=pd.MultiIndex.from_product([["Section1","Section2"],["k1","k2"]])

)
df_2

   Section1         Section2
         k1      k2       k1    k2
C1        1  Mubeen     Temp  Temp
C2        2     Ali     Temp  Temp
C3        3   Usman     Temp  Temp
C4        4   Bilal     Temp  Temp

In [69]:
df_2["Section1"]

   k1      k2
C1  1  Mubeen
C2  2     Ali
C3  3   Usman
C4  4   Bilal

In [70]:
df_2["Section2"]

      k1    k2
C1  Temp  Temp
C2  Temp  Temp
C3  Temp  Temp
C4  Temp  Temp

### Example 2

In [71]:
# with tuple
pd.MultiIndex.from_tuples([
    ("cse",2019),
    ("cse",2020),
    ("cse",2021),
    ("cse",2022),
    ("ece",2019),
    ("ece",2020),
    ("ece",2021),
    ("ece",2022),
    ])

MultiIndex([('cse', 2019),
            ('cse', 2020),
            ('cse', 2021),
            ('cse', 2022),
            ('ece', 2019),
            ('ece', 2020),
            ('ece', 2021),
            ('ece', 2022)],
           )

In [72]:
# with product
multi_index = pd.MultiIndex.from_product(
    [ 
        ["cse","ece"], [2019,2020,2021,2022] 
     
     ])


multi_index

MultiIndex([('cse', 2019),
            ('cse', 2020),
            ('cse', 2021),
            ('cse', 2022),
            ('ece', 2019),
            ('ece', 2020),
            ('ece', 2021),
            ('ece', 2022)],
           )

In [73]:
# create dataframe
tst_1 = pd.DataFrame( [
    
    [1,2],
    [3,4],
    [5,6],
    [7,8],
    [9,10],
    [11,12],
    [13,14],
    [15,16]
] )

tst_1

    0   1
0   1   2
1   3   4
2   5   6
3   7   8
4   9  10
5  11  12
6  13  14
7  15  16

In [74]:
# add index and columns
tst_1.index = multi_index
tst_1.columns = ["avg_pkg","std"]

tst_1

          avg_pkg  std
cse 2019        1    2
    2020        3    4
    2021        5    6
    2022        7    8
ece 2019        9   10
    2020       11   12
    2021       13   14
    2022       15   16

In [75]:
# check shape
tst_1.shape

(8, 2)

In [76]:
# access multindex

tst_1.loc["cse"]

      avg_pkg  std
2019        1    2
2020        3    4
2021        5    6
2022        7    8

In [77]:
tst_1.loc["ece"]

      avg_pkg  std
2019        9   10
2020       11   12
2021       13   14
2022       15   16

In [78]:
# direct access columns 

tst_1["avg_pkg"]

cse  2019     1
     2020     3
     2021     5
     2022     7
ece  2019     9
     2020    11
     2021    13
     2022    15
Name: avg_pkg, dtype: int64

In [79]:
tst_1["std"]

cse  2019     2
     2020     4
     2021     6
     2022     8
ece  2019    10
     2020    12
     2021    14
     2022    16
Name: std, dtype: int64

## Multi Index on column

In [80]:

tst_2 = pd.DataFrame([
    
    [1,2,0,0],
    [3,4,5,6],
    [8,6,5,8],
    [6,3,2,6]

])

tst_2

   0  1  2  3
0  1  2  0  0
1  3  4  5  6
2  8  6  5  8
3  6  3  2  6

In [81]:
tst_2.index = [2019,2020,2021,2022]

tst_2.columns = pd.MultiIndex.from_product([
    ["Lahore","Karachi"],
    ["avg_pkg","std"]
    ])

tst_2

      Lahore     Karachi
     avg_pkg std avg_pkg std
2019       1   2       0   0
2020       3   4       5   6
2021       8   6       5   8
2022       6   3       2   6

In [82]:
# access 5 2020

tst_2.loc[2020]

Lahore   avg_pkg    3
         std        4
Karachi  avg_pkg    5
         std        6
Name: 2020, dtype: int64

In [83]:
tst_2.loc[2020]["Karachi"]["avg_pkg"]

5

### MultiIndex on columns and Index Both

In [84]:
col = pd.MultiIndex.from_product([
    ["Lahore","Karachi"],
    ["avg_pkg","std"]
    ])

In [85]:
col

MultiIndex([( 'Lahore', 'avg_pkg'),
            ( 'Lahore',     'std'),
            ('Karachi', 'avg_pkg'),
            ('Karachi',     'std')],
           )

In [86]:
ind = pd.MultiIndex.from_product(
    [ 
        ["cse","ece"], [2019,2020,2021,2022] 
     
     ])

ind

MultiIndex([('cse', 2019),
            ('cse', 2020),
            ('cse', 2021),
            ('cse', 2022),
            ('ece', 2019),
            ('ece', 2020),
            ('ece', 2021),
            ('ece', 2022)],
           )

In [87]:
# Dataframe with multi index and columns

num = np.arange(4*8).reshape(8,4)

mul_df = pd.DataFrame(num,columns=col,index=ind)
mul_df

          Lahore     Karachi
         avg_pkg std avg_pkg std
cse 2019       0   1       2   3
    2020       4   5       6   7
    2021       8   9      10  11
    2022      12  13      14  15
ece 2019      16  17      18  19
    2020      20  21      22  23
    2021      24  25      26  27
    2022      28  29      30  31

In [88]:
# shape 
mul_df.shape

(8, 4)

### What is the Dimmension of df ?

In [89]:
# access 10
mul_df["Karachi"]["avg_pkg"]["cse"][2021]

10

In [90]:
mul_df.loc["cse"]["Karachi"]["avg_pkg"][2021]

# we need the 4 no of information
# So df is 4 Dim

10

## UnStacking

In [91]:
 tst_1

          avg_pkg  std
cse 2019        1    2
    2020        3    4
    2021        5    6
    2022        7    8
ece 2019        9   10
    2020       11   12
    2021       13   14
    2022       15   16

In [92]:
# unstack get the level 1 series and add in column (multi column)
tst_1.unstack()

    avg_pkg                 std
       2019 2020 2021 2022 2019 2020 2021 2022
cse       1    3    5    7    2    4    6    8
ece       9   11   13   15   10   12   14   16

In [93]:
# now cse , ece add in column
tst_1.unstack().unstack()

avg_pkg  2019  cse     1
               ece     9
         2020  cse     3
               ece    11
         2021  cse     5
               ece    13
         2022  cse     7
               ece    15
std      2019  cse     2
               ece    10
         2020  cse     4
               ece    12
         2021  cse     6
               ece    14
         2022  cse     8
               ece    16
dtype: int64

## Stacking

In [94]:
tst_1

          avg_pkg  std
cse 2019        1    2
    2020        3    4
    2021        5    6
    2022        7    8
ece 2019        9   10
    2020       11   12
    2021       13   14
    2022       15   16

In [95]:
tst_1.unstack()

    avg_pkg                 std
       2019 2020 2021 2022 2019 2020 2021 2022
cse       1    3    5    7    2    4    6    8
ece       9   11   13   15   10   12   14   16

In [96]:
# Unstack get the insider row and add in the column
# So stack get the insider column add in the rows

tst_1.unstack().stack()
# year add in rows

          avg_pkg  std
cse 2019        1    2
    2020        3    4
    2021        5    6
    2022        7    8
ece 2019        9   10
    2020       11   12
    2021       13   14
    2022       15   16

In [97]:
# now apply onces more stack
# Here df have 2 columns avg_pkg , std
# So when we apply stack then columns are add in rows

tst_1.unstack().stack().stack()
# now data is series

cse  2019  avg_pkg     1
           std         2
     2020  avg_pkg     3
           std         4
     2021  avg_pkg     5
           std         6
     2022  avg_pkg     7
           std         8
ece  2019  avg_pkg     9
           std        10
     2020  avg_pkg    11
           std        12
     2021  avg_pkg    13
           std        14
     2022  avg_pkg    15
           std        16
dtype: int64

### Example 2

In [98]:
tst_2

      Lahore     Karachi
     avg_pkg std avg_pkg std
2019       1   2       0   0
2020       3   4       5   6
2021       8   6       5   8
2022       6   3       2   6

In [99]:
# avg_pkg std, avg_pkg, std add in row

tst_2.stack()

              Karachi  Lahore
2019 avg_pkg        0       1
     std            0       2
2020 avg_pkg        5       3
     std            6       4
2021 avg_pkg        5       8
     std            8       6
2022 avg_pkg        2       6
     std            6       3

In [100]:
# now Karachi , Lahore also add in row
tst_2.stack().stack()

2019  avg_pkg  Karachi    0
               Lahore     1
      std      Karachi    0
               Lahore     2
2020  avg_pkg  Karachi    5
               Lahore     3
      std      Karachi    6
               Lahore     4
2021  avg_pkg  Karachi    5
               Lahore     8
      std      Karachi    8
               Lahore     6
2022  avg_pkg  Karachi    2
               Lahore     6
      std      Karachi    6
               Lahore     3
dtype: int64

In [101]:
# So now data is series 
# what happend if we apply on unstack()

# can we move on 1 step back ?
tst_2.stack().stack().unstack()

              Karachi  Lahore
2019 avg_pkg        0       1
     std            0       2
2020 avg_pkg        5       3
     std            6       4
2021 avg_pkg        5       8
     std            8       6
2022 avg_pkg        2       6
     std            6       3

In [102]:
# now if we apply unstack() one more time
# can we move on real type df ?
tst_2.stack().stack().unstack().unstack()

     Karachi      Lahore
     avg_pkg std avg_pkg std
2019       0   0       1   2
2020       5   6       3   4
2021       5   8       8   6
2022       2   6       6   3

In [103]:
# now apply unstack() once more time
# years move on columns
tst_2.stack().stack().unstack().unstack().unstack()

Karachi  avg_pkg  2019    0
                  2020    5
                  2021    5
                  2022    2
         std      2019    0
                  2020    6
                  2021    8
                  2022    6
Lahore   avg_pkg  2019    1
                  2020    3
                  2021    8
                  2022    6
         std      2019    2
                  2020    4
                  2021    6
                  2022    3
dtype: int64

### Example on multi index,column df

In [104]:
mul_df

          Lahore     Karachi
         avg_pkg std avg_pkg std
cse 2019       0   1       2   3
    2020       4   5       6   7
    2021       8   9      10  11
    2022      12  13      14  15
ece 2019      16  17      18  19
    2020      20  21      22  23
    2021      24  25      26  27
    2022      28  29      30  31

In [105]:
# avg_pkg std both add in row
mul_df.stack()

                  Karachi  Lahore
cse 2019 avg_pkg        2       0
         std            3       1
    2020 avg_pkg        6       4
         std            7       5
    2021 avg_pkg       10       8
         std           11       9
    2022 avg_pkg       14      12
         std           15      13
ece 2019 avg_pkg       18      16
         std           19      17
    2020 avg_pkg       22      20
         std           23      21
    2021 avg_pkg       26      24
         std           27      25
    2022 avg_pkg       30      28
         std           31      29

In [106]:
## add Karachi lahore in the rows
mul_df.stack().stack()

cse  2019  avg_pkg  Karachi     2
                    Lahore      0
           std      Karachi     3
                    Lahore      1
     2020  avg_pkg  Karachi     6
                    Lahore      4
           std      Karachi     7
                    Lahore      5
     2021  avg_pkg  Karachi    10
                    Lahore      8
           std      Karachi    11
                    Lahore      9
     2022  avg_pkg  Karachi    14
                    Lahore     12
           std      Karachi    15
                    Lahore     13
ece  2019  avg_pkg  Karachi    18
                    Lahore     16
           std      Karachi    19
                    Lahore     17
     2020  avg_pkg  Karachi    22
                    Lahore     20
           std      Karachi    23
                    Lahore     21
     2021  avg_pkg  Karachi    26
                    Lahore     24
           std      Karachi    27
                    Lahore     25
     2022  avg_pkg  Karachi    30
                    Lahore     28
           std      Karachi    31
                    Lahore     29
dtype: int64

In [107]:
# now move 1 step back
mul_df.stack().stack().unstack()

                  Karachi  Lahore
cse 2019 avg_pkg        2       0
         std            3       1
    2020 avg_pkg        6       4
         std            7       5
    2021 avg_pkg       10       8
         std           11       9
    2022 avg_pkg       14      12
         std           15      13
ece 2019 avg_pkg       18      16
         std           19      17
    2020 avg_pkg       22      20
         std           23      21
    2021 avg_pkg       26      24
         std           27      25
    2022 avg_pkg       30      28
         std           31      29

In [108]:
# once more step back
mul_df.stack().stack().unstack().unstack()

         Karachi      Lahore
         avg_pkg std avg_pkg std
cse 2019       2   3       0   1
    2020       6   7       4   5
    2021      10  11       8   9
    2022      14  15      12  13
ece 2019      18  19      16  17
    2020      22  23      20  21
    2021      26  27      24  25
    2022      30  31      28  29

In [109]:
# now add year in column
mul_df.stack().stack().unstack().unstack().unstack()

    Karachi                                     Lahore                      \
    avg_pkg                 std                avg_pkg                 std
       2019 2020 2021 2022 2019 2020 2021 2022    2019 2020 2021 2022 2019
cse       2    6   10   14    3    7   11   15       0    4    8   12    1
ece      18   22   26   30   19   23   27   31      16   20   24   28   17



    2020 2021 2022
cse    5    9   13
ece   21   25   29

In [110]:
# now add cse ece in column
mul_df.stack().stack().unstack().unstack().unstack().unstack()

Karachi  avg_pkg  2019  cse     2
                        ece    18
                  2020  cse     6
                        ece    22
                  2021  cse    10
                        ece    26
                  2022  cse    14
                        ece    30
         std      2019  cse     3
                        ece    19
                  2020  cse     7
                        ece    23
                  2021  cse    11
                        ece    27
                  2022  cse    15
                        ece    31
Lahore   avg_pkg  2019  cse     0
                        ece    16
                  2020  cse     4
                        ece    20
                  2021  cse     8
                        ece    24
                  2022  cse    12
                        ece    28
         std      2019  cse     1
                        ece    17
                  2020  cse     5
                        ece    21
                  2021  cse     9
                        ece    25
                  2022  cse    13
                        ece    29
dtype: int64

In [111]:
temp = mul_df.stack().stack().unstack().unstack().unstack().unstack()

# store previous data in temp

temp

Karachi  avg_pkg  2019  cse     2
                        ece    18
                  2020  cse     6
                        ece    22
                  2021  cse    10
                        ece    26
                  2022  cse    14
                        ece    30
         std      2019  cse     3
                        ece    19
                  2020  cse     7
                        ece    23
                  2021  cse    11
                        ece    27
                  2022  cse    15
                        ece    31
Lahore   avg_pkg  2019  cse     0
                        ece    16
                  2020  cse     4
                        ece    20
                  2021  cse     8
                        ece    24
                  2022  cse    12
                        ece    28
         std      2019  cse     1
                        ece    17
                  2020  cse     5
                        ece    21
                  2021  cse     9
                        ece    25
                  2022  cse    13
                        ece    29
dtype: int64

In [112]:
# here we have no columns in the temp

# Unstack get the insider row and add in the column
# So stack get the insider column add in the rows

# so when i apply stack() get the error ?
# BEcause we have not a column
temp.stack()

AttributeError: 'Series' object has no attribute 'stack'

In [113]:
# but we can apply a unstack becuase we have index

temp.unstack()

                      cse  ece
Karachi avg_pkg 2019    2   18
                2020    6   22
                2021   10   26
                2022   14   30
        std     2019    3   19
                2020    7   23
                2021   11   27
                2022   15   31
Lahore  avg_pkg 2019    0   16
                2020    4   20
                2021    8   24
                2022   12   28
        std     2019    1   17
                2020    5   21
                2021    9   25
                2022   13   29

In [114]:
#add year in column
temp.unstack().unstack()

                 cse                 ece
                2019 2020 2021 2022 2019 2020 2021 2022
Karachi avg_pkg    2    6   10   14   18   22   26   30
        std        3    7   11   15   19   23   27   31
Lahore  avg_pkg    0    4    8   12   16   20   24   28
        std        1    5    9   13   17   21   25   29

In [115]:
# now check the multi df data both are same ?
mul_df

          Lahore     Karachi
         avg_pkg std avg_pkg std
cse 2019       0   1       2   3
    2020       4   5       6   7
    2021       8   9      10  11
    2022      12  13      14  15
ece 2019      16  17      18  19
    2020      20  21      22  23
    2021      24  25      26  27
    2022      28  29      30  31

In [116]:
# yes both are same if we get the transform

temp.unstack().unstack().T

         Karachi      Lahore
         avg_pkg std avg_pkg std
cse 2019       2   3       0   1
    2020       6   7       4   5
    2021      10  11       8   9
    2022      14  15      12  13
ece 2019      18  19      16  17
    2020      22  23      20  21
    2021      26  27      24  25
    2022      30  31      28  29

### levels parameter

In [117]:
mul_df

          Lahore     Karachi
         avg_pkg std avg_pkg std
cse 2019       0   1       2   3
    2020       4   5       6   7
    2021       8   9      10  11
    2022      12  13      14  15
ece 2019      16  17      18  19
    2020      20  21      22  23
    2021      24  25      26  27
    2022      28  29      30  31

In [119]:
# if we apply unstack than years (level 1) are and in columns
mul_df.unstack()

     Lahore                                    Karachi                      \
    avg_pkg                 std                avg_pkg                 std
       2019 2020 2021 2022 2019 2020 2021 2022    2019 2020 2021 2022 2019
cse       0    4    8   12    1    5    9   13       2    6   10   14    3
ece      16   20   24   28   17   21   25   29      18   22   26   30   19



    2020 2021 2022
cse    7   11   15
ece   23   27   31

In [120]:
# change level
mul_df.unstack(level=0)

# now cse are add in colums

      Lahore             Karachi
     avg_pkg     std     avg_pkg     std
         cse ece cse ece     cse ece cse ece
2019       0  16   1  17       2  18   3  19
2020       4  20   5  21       6  22   7  23
2021       8  24   9  25      10  26  11  27
2022      12  28  13  29      14  30  15  31

In [121]:
# same as stack

mul_df.stack()

                  Karachi  Lahore
cse 2019 avg_pkg        2       0
         std            3       1
    2020 avg_pkg        6       4
         std            7       5
    2021 avg_pkg       10       8
         std           11       9
    2022 avg_pkg       14      12
         std           15      13
ece 2019 avg_pkg       18      16
         std           19      17
    2020 avg_pkg       22      20
         std           23      21
    2021 avg_pkg       26      24
         std           27      25
    2022 avg_pkg       30      28
         std           31      29

In [122]:
mul_df.stack(level=0) 
# change level

                  avg_pkg  std
cse 2019 Karachi        2    3
         Lahore         0    1
    2020 Karachi        6    7
         Lahore         4    5
    2021 Karachi       10   11
         Lahore         8    9
    2022 Karachi       14   15
         Lahore        12   13
ece 2019 Karachi       18   19
         Lahore        16   17
    2020 Karachi       22   23
         Lahore        20   21
    2021 Karachi       26   27
         Lahore        24   25
    2022 Karachi       30   31
         Lahore        28   29